multiple-perpendicular-flaps/fluid-openfoam/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}

dynamicFvMesh       dynamicMotionSolverFvMesh;

motionSolverLibs    ("libfvMotionSolvers.so");

solver              displacementLaplacian;

displacementLaplacianCoeffs {
    diffusivity quadratic inverseDistance (flap1);
    diffusivity quadratic inverseDistance (flap2);
}
